// Sass
import style from "./About.module.scss";
// Images
// import about from "../../Assets/Images/3.jpg";
// React
import { useEffect } from "react";
// Components
import Footer from "../../Components/Footer";
import Banner from "../../Components/Banner";
import Navbar from "../../Components/Navbar";

export default function About() {
  useEffect(() => {
    window.scroll({
      top: 0,
      left: 0,
      behavior: "auto",
    });
  }, []);

  return (
    <>
      {/* Start Hero */}
      <div className={style.hero_container}>
        <Banner />

        <div className={style.nav_container}>
          <Navbar />
        </div>
      </div>
      {/* End Hero */}

      <div dir="rtl" className={style.container}>
        <div className={style.long_text}>
          <div className={style.hero_text_box} dir="ltr">
            <h1>من نحن</h1>
          </div>

          <p>خدمات قانونية شاملة ومُصممة خصيصًا لتلبية احتياجاتك</p>

          <p>
            نُقدم لك مجموعة مُتكاملة من الخدمات القانونية التي تُغطي كافة جوانب
            حياتك وأعمالك.
          </p>
          <p>
            سواء كنت فردًا عاديًا أو شركة كبيرة، لدينا فريق مُتخصص من القانونيين
            ذوي الخبرة والكفاءة العالية القادرين على مساعدتك في اتخاذ قرارات
            سليمة ومُستنيرة.
          </p>

          <div
            className={style.our_message_container}
            style={{ paddingRight: "0px", marginTop: "32px" }}
          >
            <h3 style={{ marginTop: "16px" }}>ما يُميز خدماتنا</h3>
            <ul>
              <li>
                <span>تخصص دقيق: </span>قمنا بتحديد الاختصاصات المتخصصة في كل
                مجال قانوني لضمان حصولك على أفضل الخِدْمات من مُتخصصين مُتمرسين.
              </li>
              <li>
                <span>شمولية الخدمات: </span>نُغطي كافة فروع القانون، من القانون
                المدني والتجاري إلى القانون الجنائي والإداري، بالإضافة إلى قضايا
                الأسرة والعقارات.
              </li>
              <li>
                <span>احترافية عالية: </span>نلتزم بأعلى معايير الاحترافية
                والأخلاق المهنية في تقديم خدماتنا، و نحرص على الحفاظ على سرية
                معلوماتك.
              </li>
              <li>
                <span>مُتابعة دقيقة: </span>نُتابع قضاياك باهتمام بالغ ونُبقيك
                على اطلاع دائم بآخر التطورات.
              </li>
              <li>
                <span>استشارات مُخصصة: </span>نُقدم لك استشارات قانونية مُخصصة
                لفهم وضعك القانوني بشكل كامل ومساعدتك في اتخاذ القرارات الصحيحة.
              </li>
            </ul>
          </div>

          <div
            className={style.our_message_container}
            style={{ paddingRight: "0px" }}
          >
            <h3 style={{ marginTop: "16px" }}>
              كيف نساعدك في اتخاذ قرارات سليمة؟
            </h3>
            <ul>
              <li>
                <span>تحليل شامل: </span>نقوم بتحليل وضعك القانوني بشكل شامل
                ودقيق لتحديد نقاط قوتك وضعفك.
              </li>
            </ul>
            <ul>
              <li>
                <span>توضيح المخاطر: </span>نُوضح لك المخاطر والتحديات القانونية
                التي قد تواجهك.
              </li>
            </ul>
            <ul>
              <li>
                <span>تقديم الحلول: </span>نُقدم لك مجموعة متنوعة من الحلول
                القانونية المُناسبة لوضعك.
              </li>
            </ul>
            <ul>
              <li>
                <span>المشورة والتوجيه: </span>نُقدم لك المشورة والتوجيه
                اللازمين لاتخاذ القرارات الصحيحة والمُستنيرة.
              </li>
            </ul>
            <ul>
              <li>
                <span>الدعم والمُساندة: </span>نُقدم لك الدعم والمُساندة في جميع
                مراحل القضية.
              </li>
            </ul>
          </div>
        </div>
      </div>

      <div dir="rtl" className={style.our_message_container}>
        <div className={style.long_text}>
          <div className={style.hero_text_box} dir="ltr">
            <h1 dir="rtl">رسالتنا ورؤيتنا:</h1>
            <p dir="rtl">
              تسعى شركة سمو الإنصاف إلى تقديم خدمات قانونية متميزة تلبي احتياجات
              العملاء وتفوق توقعاتهم. وتلتزم الشركة بأعلى معايير الجودة والنزاهة
              في جميع أعمالها.
            </p>
            <p style={{ width: "100%" }} dir="rtl">
              تغطي الشركة مجموعة واسعة من الممارسات القانونية لتلبية احتياجات
              عملائها المتنوعة, تشمل ممارساتنا الرئيسية:
            </p>
          </div>

          <div>
            <ul>
              <li>
                <span>القانون المالي:</span> نقدم خدمات قانونية متكاملة في مجال
                قضايا التركات، بما في ذلك إعداد الوصايا وتقسيم التركات وإدارة
                شؤونها.
              </li>

              <li>
                <span>قانون التركات:</span> نقدم دعما قانونيا متخصصا في مطالبات
                التعويضات، نزاعات التأمين وحماية الحقوق في جميع الأنواع
              </li>

              <li>
                <span>القانون التجاري:</span> نقدم خدمات قانونية شاملة في مجال
                القانون التجاري، بما في ذلك تأسيس الشركات والعقود التجارية وحل
                النزاعات التجارية.
              </li>

              <li>
                <span>القانون العقاري:</span> نقدم خدمات قانونية متخصصة في مجال
                القانون العقاري، بما في ذلك شراء وبيع العقارات وإدارة العقارات
                وتسجيلها.
              </li>

              <li>
                <span>قانون الشركات:</span> نقدم خدمات قانونية متكاملة في مجال
                قانون الشركات، بما في ذلك تأسيس الشركات وإعادة هيكلتها واندماجها
                والاستحواذ عليها.
              </li>

              <li>
                <span>القانون الجنائي:</span> نقدم خدمات قانونية متخصصة في مجال
                القانون الجنائي، بما في ذلك الدفاع عن المتهمين في القضايا
                الجنائية وتقديم الشكاوى الجزائية.
              </li>

              <li>
                <span>القانون الإداري:</span> نقدم خدمات قانونية متخصصة في مجال
                القانون الإداري، بما في ذلك الطعون الإدارية والنزاعات مع الجهات
                الحكومية.
              </li>

              <li>
                <span>قانون العمل:</span> نقدم خدمات قانونية متكاملة في مجال
                قانون العمل، بما في ذلك عقود العمل وحقوق العمال وإنهاء الخدمات.
              </li>

              <li>
                <span>قانون التنفيذ:</span> نقدم خدمات قانونية متخصصة في مجال
                قانون التنفيذ، بما في ذلك تنفيذ الأحكام القضائية والسندات
                التنفيذية.
              </li>

              <li>
                <span>التحكيم:</span> نقدم خدمات قانونية متخصصة في مجال التحكيم،
                بما في ذلك تمثيل العملاء في إجراءات التحكيم وإعداد اتفاقيات
                التحكيم.
              </li>

              <li>
                <span>قانون الصحة:</span> نقدم خدمات قانونية متخصصة في مجال
                قانون الصحة، بما في ذلك الاستشارات المتعلقة بالتراخيص الصحية
                والمسؤولية الطبية.
              </li>
            </ul>
            <p>
              نحن في شركة سمو الإنصاف ملتزمون بتقديم خدمات قانونية عالية الجودة
              تلبي احتياجات عملائنا وتحقق رضاهم.إذا كان لديك أي أسئلة أو
              إستفسارات، فلا تتردد في التواصل معنا.
            </p>
          </div>
        </div>
      </div>

      {/*  */}
      {/* <div dir="rtl" className={style.our_message_container}>
        <div className={style.long_text}>
          <div className={style.hero_text_box} dir="ltr">
            <h1 dir="rtl">فريق الإدارة:</h1>
          </div>

          <p style={{ marginBottom: "16px" }}>
            يتألف فريق شركة سمو الإنصاف للمحاماة والاستشارات القانونية من محامين
            ومستشارين ذوي خبرة قانونية عالية ، متنوع من حيث التخصص ، وهذا التنوع
            كان مصدر إثراء وفاعلية في التعاطي مع مختلف القضايا والاستشارات
            القانونية. كما نفخر بأن لدينا فريق يتمتع بمستوى عال من الوعي
            التجاري، أسهم في توثيق الروابط مع بيئات ومجتمعات الأعمال واستمرارها،
            وبالتالي فهم لديهم فهم خاص للقضايا التجارية التي تواجه عملائنا في
            مختلف القطاعات التي يعملون فيها.
          </p>

          <div>
            <ul>
              <li style={{ color: "#383c45" }}>
                المدير العام والمؤسس : ناصر بن جمعان الكيرعاني.
              </li>
              <li style={{ color: "#383c45" }}>
                مستشار شرعي وقانوني / نصير بن محمد الهاشمي
              </li>
              <li style={{ color: "#383c45" }}>
                المحامية / إلهام بنت أحمد الجريفاني.
              </li>
              <li style={{ color: "#383c45" }}>
                المحامي / عبدالله بن سعيد السلاطين.
              </li>
              <li style={{ color: "#383c45" }}>
                المحامي / عبدالله بن علي حكمي.
              </li>
              <li style={{ color: "#383c45" }}>
                المحامي / ليث بن مقبول الخثعمي.
              </li>
              <li style={{ color: "#383c45" }}>
                مستشار شرعي وقانوني / قدري محمد عبد السلام
              </li>
            </ul>
          </div>
        </div>
      </div> */}

      <Footer />
    </>
  );
}
