// Sass
import style from "./About.module.scss";
// Images
import about from "../../Assets/Images/3.jpg";
// React
import { useEffect } from "react";
// Components
import Footer from "../../Components/Footer";
import Banner from "../../Components/Banner";
import Navbar from "../../Components/Navbar";

export default function About() {
  useEffect(() => {
    window.scroll({
      top: 0,
      left: 0,
      behavior: "auto",
    });
  }, []);

  return (
    <>
      {/* Start Hero */}
      <div className={style.hero_container}>
        <Banner />

        <div className={style.nav_container}>
          <Navbar />
        </div>
      </div>
      {/* End Hero */}

      <div dir="rtl" className={style.container}>
        <div className={style.long_text}>
          <div className={style.hero_text_box} dir="ltr">
            <h1>من نحن</h1>
          </div>

          <p>
            شركة سمو الإنصاف للمحاماة والاستشارات القانونية أحد أبرز الشركات
            الرائدة في مهنة المحاماة وتقديم كافة أنواع الخدمات القانونية
            بالمملكة العربية السعودية.
          </p>
          <p>
            تقدم الشركة الخدمات القانونية بجودة عالية وأداء إحترافي والتي تخدم
            جميع القطاعات التجارية والصناعية والمالية والعقارية بكفاءة عالية
            وخبرة كبيرة في إنجاز الأعمال القانونية ضمن فريق عمل قانوني احترافي.
          </p>
          <p>
            خبرة واسعة في إدارة القضايا وتمثيل العملاء في جميع أنواع المحاكم
            والهيئات واللجان شبه قضائية المختصة.
          </p>
          <p>
            القيام بتفريغ فريق أساسي جاهز مكون من مستشارين متمرسين قادرين على
            إنجاز ما يكلفون به من مهام ترد إليهم من قبل شركتكم.
          </p>
          <p>
            خدمة التحكيم التجاري في المنازعات التي يشترط فيها وجود محكم قانوني
            بإعتبار أن المكتب يضم كادر من المحكمين القانونين المعتمدين لدى وزارة
            العدل.
          </p>

          <p>
            يتكون فريق العمل من نخبة متميزة من الكوادر المهنية من محامين
            ومستشارين في معظم مجالات القانون.
          </p>
          <p>
            فريق من المحامين المتخصصين في الأنظمة التجارية والعقارية والشركات
            والتمويل والقضايا العمالية وكافة الخدمات القانونية.
          </p>
          <p>
            تحصيل المبالغ المستحقة لكم سواء في القطاعين الحكومي أو الخاص، وذلك
            عن طريق المفاوضات والتسويات والمفاهمات الودية.
          </p>
          <p>
            تنوع كبير في العملاء حيث قدمنا المشورة لشركات المشاريع، والمساهمين
            المؤسسين، والسلطات المانحة الامتيازات، والبنوك، والممولين، مما يوفر
            رؤية متعمقة وفريدة لمتطلبات كل طرف.
          </p>
          <p>
            إن المحامين المكلفين بالمهام سوف يقومون بدور مباشر ويشاركون في جميع
            نواحي تقديم الاستشارات.
          </p>
        </div>
      </div>

      <div dir="rtl" className={style.our_message_container}>
        <div className={style.long_text}>
          <div className={style.hero_text_box} dir="ltr">
            <h1 dir="rtl">رسالتنا ورؤيتنا:</h1>
          </div>

          <div>
            <ul>
              <li>
                <span>العمل الجاد</span> الدؤوب المخلص لتحقيق أهدافنا.
              </li>
              <li>
                <span>أن نكون</span> من الشركات الرائدة في هذا المجال.
              </li>
              <li>
                <span>أن نكون مثالا</span> يحتذى به بين نظرائنا من الشركات داخل
                المملكة العربية السعودية من خلال الكفاءة العالية والحفاظ على
                المصداقية وثقة المتعاملين معنا.
              </li>
              <li>
                <span>السعي الدائم</span> لضمان الحق والعدالة في معاملتنا مع
                موظفينا وعملائنا فهم بحق شركاء النجاح معنا.
              </li>
              <li>
                <span>البحث المستمر</span> المتجدد لأحدث ما وصل إليه العالم
                الغربي والدول المتقدمة في مجال أنظمة المحاماة والاستشارات
                القانونية.
              </li>
            </ul>
          </div>
        </div>
      </div>

      {/*  */}
      <div dir="rtl" className={style.our_message_container}>
        <div className={style.long_text}>
          <div className={style.hero_text_box} dir="ltr">
            <h1 dir="rtl">فريق الإدارة:</h1>
          </div>

          <p style={{ marginBottom: "16px" }}>
            يتألف فريق شركة سمو الإنصاف للمحاماة والاستشارات القانونية من محامين
            ومستشارين ذوي خبرة قانونية عالية ، متنوع من حيث التخصص ، وهذا التنوع
            كان مصدر إثراء وفاعلية في التعاطي مع مختلف القضايا والاستشارات
            القانونية. كما نفخر بأن لدينا فريق يتمتع بمستوى عال من الوعي
            التجاري، أسهم في توثيق الروابط مع بيئات ومجتمعات الأعمال واستمرارها،
            وبالتالي فهم لديهم فهم خاص للقضايا التجارية التي تواجه عملائنا في
            مختلف القطاعات التي يعملون فيها.
          </p>

          <div>
            <ul>
              <li style={{ color: "#383c45" }}>
                المدير العام والمؤسس : ناصر بن جمعان الكيرعاني.
              </li>
              <li style={{ color: "#383c45" }}>
                مستشار شرعي وقانوني / نصير بن محمد الهاشمي
              </li>
              <li style={{ color: "#383c45" }}>
                المحامية / إلهام بنت أحمد الجريفاني.
              </li>
              <li style={{ color: "#383c45" }}>
                المحامي / عبدالله بن سعيد السلاطين.
              </li>
              <li style={{ color: "#383c45" }}>
                المحامي / عبدالله بن علي حكمي.
              </li>
              <li style={{ color: "#383c45" }}>
                المحامي / ليث بن مقبول الخثعمي.
              </li>
              <li style={{ color: "#383c45" }}>
                مستشار شرعي وقانوني / قدري محمد عبد السلام
              </li>
            </ul>
          </div>
        </div>
      </div>

      <Footer />
    </>
  );
}
