// Sass
import style from "./About.module.scss";
// Images
import about from "../../Assets/Images/3.jpg";
// React
import { useEffect } from "react";
// Components
import Footer from "../../Components/Footer";
import Banner from "../../Components/Banner";
import Navbar from "../../Components/Navbar";
import HeroTextAndBtn from "../../Components/HeroTextAndBtn";

export default function About() {
  useEffect(() => {
    window.scroll({
      top: 0,
      left: 0,
      behavior: "auto",
    });
  }, []);

  return (
    <>
      {/* Start Hero */}
      <div className={style.hero_container}>
        <Banner />
        <Navbar />
        {/* <div className={style.bg_container}> */}
        {/* <div> */}
        {/* <h1>من نحن</h1> */}
        {/* <h5>نحقق العدالة بالخبرة ونحقق الإنصاف بالجدارة</h5> */}
        {/* </div> */}
        {/* </div> */}
      </div>
      {/* End Hero */}

      <div dir="rtl" className={style.container}>
        {/* <div className={style.hero_box}>
          <div>
            <h1>
              فريق عمل من المحترفين لبناء مشروعك بالكامل, بداية من الدراسة
              للتصميم والبرمجة حتى التسويق.
            </h1>

            <ul>
              <li>مدير خاص بكل مشروع لسهولة وسرعة التنسيق</li>
              <li>اجتماعات اون لاين لمناقشة المشروع</li>
              <li>أسعار منافسة للخدمات</li>
            </ul>
          </div>

          <div>
            <img src={about} alt="about us" />
          </div>
        </div> */}

        <div className={style.long_text}>
          <div className={style.hero_text_box} dir="ltr">
            <h1>من نحن</h1>
          </div>

          <p>
            شركة سمو الإنصاف للمحاماة والاستشارات القانونية أحد أبرز الشركات
            الرائدة في مهنة المحاماة وتقديم كافة أنواع الخدمات القانونية
            بالمملكة العربية السعودية .
          </p>
          <p>
            تقدم الشركة الخدمات القانونية بجودة عالية وأداء إحترافي والتي تخدم
            جميع القطاعات التجارية والصناعية والمالية والعقارية بكفاءة عالية
            وخبرة كبيرة في إنجاز الأعمال القانونية ضمن فريق عمل قانوني احترافي.
          </p>
          <p>
            خبرة واسعة في إدارة القضايا وتمثيل العملاء في جميع أنواع المحاكم
            والهيئات واللجان شبه قضائية المختصة.
          </p>
          <p>
            القيام بتفريغ فريق أساسي جاهز مكون من مستشارين متمرسين قادرين على
            إنجاز ما يكلفون به من مهام ترد إليهم من قبل شركتكم .
          </p>
          <p>
            خدمة التحكيم التجاري في المنازعات التي يشترط فيها وجود محكم قانوني
            بإعتبار أن المكتب يضم كادر من المحكمين القانونين المعتمدين لدى وزارة
            العدل .
          </p>

          <p>
            يتكون فريق العمل من نخبة متميزة من الكوادر المهنية من محامين
            ومستشارين في معظم مجالات القانون.
          </p>
          <p>
            فريق من المحامين المتخصصين في الأنظمة التجارية والعقارية والشركات
            والتمويل والقضايا العمالية وكافة الخدمات القانونية.
          </p>
          <p>
            تحصيل المبالغ المستحقة لكم سواء في القطاعين الحكومي أو الخاص، وذلك
            عن طريق المفاوضات والتسويات والمفاهمات الودية .
          </p>
          <p>
            تنوع كبير في العملاء حيث قدمنا المشورة لشركات المشاريع، والمساهمين
            المؤسسين، والسلطات المانحة الامتيازات، والبنوك، والممولين، مما يوفر
            رؤية متعمقة وفريدة لمتطلبات كل طرف .
          </p>
          <p>
            إن المحامين المكلفين بالمهام سوف يقومون بدور مباشر ويشاركون في جميع
            نواحي تقديم الاستشارات.
          </p>
        </div>
      </div>

      <Footer />
    </>
  );
}
