// React
import { useEffect } from "react";
// Sass
import style from "./Services.module.scss";
// Components
import Banner from "../../Components/Banner";
import Navbar from "../../Components/Navbar";
import Footer from "../../Components/Footer";
// Images
import servA from "../../Assets/Images/services/servA.svg";
import servB from "../../Assets/Images/services/servB.svg";
import servC from "../../Assets/Images/services/servC.svg";
import servD from "../../Assets/Images/services/servD.svg";
import servE from "../../Assets/Images/services/servE.svg";
import servF from "../../Assets/Images/services/servF.svg";
//
import video from "../../Assets/Images/services/video.mp4";
import two from "../../Assets/Images/services/2.svg";
import three from "../../Assets/Images/services/3.svg";
import four from "../../Assets/Images/services/4.svg";
import five from "../../Assets/Images/services/5.svg";
import six from "../../Assets/Images/services/6.svg";
import seven from "../../Assets/Images/services/7.svg";
import eight from "../../Assets/Images/services/8.svg";
import nine from "../../Assets/Images/services/9.svg";
import ten from "../../Assets/Images/services/10.svg";
import eleven from "../../Assets/Images/services/11.svg";
import tweleve from "../../Assets/Images/services/12.svg";
import thirteen from "../../Assets/Images/services/13.svg";
import fourteen from "../../Assets/Images/services/14.svg";
import fifteen from "../../Assets/Images/services/15.svg";

export default function Services() {
  useEffect(() => {
    window.scroll({
      top: 0,
      left: 0,
      behavior: "auto",
    });
  }, []);

  return (
    <>
      {/* Start Hero */}
      <div className={style.hero_container}>
        <Banner />

        <div className={style.nav_container}>
          <Navbar />
        </div>
      </div>
      {/* End Hero */}

      <div className={style.container}>
        <section className={style.C}>
          <h1>خدماتنا القانونية</h1>

          <div className={style.C_box}>
            <div>
              <div>
                <h3>التقاضي وتسوية المنازعات</h3>
              </div>
              <hr />
              <div>
                <img src={servB} alt="marketing" />
              </div>
            </div>

            <div>
              <div>
                <h3>الاستشارات والمساندة القانونية</h3>
              </div>
              <hr />
              <div>
                <img src={servA} alt="marketing" />
              </div>
            </div>

            <div>
              <div>
                <h3>التحكيم</h3>
              </div>
              <hr />
              <div>
                <img src={servC} alt="marketing" />
              </div>
            </div>

            <div>
              <div>
                <h3>الصياغة القانونية والتشريعية</h3>
              </div>
              <hr />
              <div>
                <img src={servD} alt="marketing" />
              </div>
            </div>

            <div>
              <div>
                <h3>المصرفية وأسواق المال</h3>
              </div>
              <hr />
              <div>
                <img src={servE} alt="marketing" />
              </div>
            </div>

            <div>
              <div>
                <h3>الشركات</h3>
              </div>
              <hr />
              <div>
                <img src={servF} alt="marketing" />
              </div>
            </div>
          </div>
        </section>

        {/* 1 */}

        <section className={style.B}>
          <h1>التقاضي وتسوية النزاعات</h1>

          <div className={style.B_box}>
            <div>
              <h6 dir="rtl">
                من خلال فريق متميز ومتخصص في مجال التقاضي وتسوية المنازعات نقدم
                الخدمات القانونية بكفاءة عالية ومقدرة على التعامل مع المسائل
                القانونية المعقدة وتقديم حلول فعالة تلبي حاجة ومتطلبات كل عميل،
                ويشمل نطاق الخدمات القانونية التي نقدمها في هذا المجال:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  الترافع وتقديم اللوائح والمذكرات أمام جميع المحاكم بمختلف
                  درجاتها.
                </li>
                <li>الخدمات الإنهائية لدى المحاكم المختصة.</li>
                <li>الحراسة القضائية والتصفية القضائية.</li>
                <li>الاعتراضات أمام محاكم الاستئناف والتماس إعادة النظر.</li>
                <li>تنفيذ الأحكام المحلية والأجنبية.</li>
              </ul>
            </div>
            <div>
              <video src={video} controls style={{ width: "100%" }}></video>
            </div>
          </div>
        </section>

        {/* 2 */}

        <section className={style.D}>
          <h1>الدراسات والاستشارات</h1>

          <div className={style.D_box}>
            <div>
              <h6 dir="rtl">
                إن ما يقوم عليه واقع علاقاتنا الإنسانية اليومي من تبادل المنافع
                والخدمات وكذلك تقاطع المصالح بين الأفراد والمؤسسات كافة يؤكد
                حتمية تنظيمها وحاجتها إلى من يحكمها ويرتبها، وبالخبرة التي تميزت
                بها كوادرنا والتي سبق وأن ساهمت في الإعداد والصياغة التشريعية
                فإننا نسعد في شركة سمو الإنصاف بتوظيف كافة خبراتنا وإمكاناتنا
                لخدمة المهتمين من خلال:
              </h6>
              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  إعداد ومراجعة وصياغة كافة العقود والاتفاقيات ومذكرات التفاهم
                  في كافة التخصصات.
                </li>
                <li>
                  إعداد ومراجعة وصياغة اتفاقيات عدم المنافسة واتفاقيات سرية
                  المعلومات.
                </li>
                <li>إعداد وصياغة عقود الاندماج أو الاستحواذ للشركات.</li>
                <li>
                  إعداد وصياغة ومراجعة الأنظمة الأساسية للشركات ولوائح الحوكمة
                  والمراجعة الداخلية.
                </li>
                <li>
                  تقديم المشورة القانونية للمستثمرين الأجانب من حيث الأنظمة
                  المتبعة في المملكة.
                </li>
                <li>
                  تأسيس الشركات الأجنبية أو المختلطة وفروعها، وإصدار التراخيص
                  والسجلات التجارية للمستثمر الأجنبي.
                </li>
              </ul>
            </div>
            <div>
              <img src={two} alt="seo" />
            </div>
          </div>
        </section>

        {/* 3 */}

        <section className={style.B}>
          <h1>الشركات والمؤسسات</h1>

          <div className={style.B_box}>
            <div dir="rtl">
              <h6>
                يرتكز العمل في قطاع الشركات وأسواق المال بالشركة على فهم وتغطية
                احتياجات عملائنا من خلال:
              </h6>
              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>تأسيس الشركات والمؤسسات وتسجيل العلامات التجارية.</li>
                <li>إدارة الصفقات الخاصة وحوكمة الشركات. والمؤسسات.</li>
                <li>إعداد الدراسات النافية للجهالة.</li>
                <li>تأسيس وحماية حقوق براءات الاختراع.</li>
                <li>إدارة عمليات الدمج والاستحواذ</li>
                <li>تسجيل الوكالات والعلامات والأسماء التجارية.</li>
                <li>
                  أعمال المساندة والتمثيل لرجال الأعمال والمنشآت في عمليات
                  التفاوض وانتهاء بإتمام أعمال الصفقات.
                </li>
                <li>
                  التمثيل القانوني في الجمعيات العمومية العادية والغير العادية
                  وإبداء الرأي القانوني
                </li>
                <li>
                  تقديم الاستشارات القانونية للشركات المساهمة المدرجة بالسوق
                  المالية.
                </li>
              </ul>
            </div>
            <div>
              <img src={three} alt="seo" />
            </div>
          </div>
        </section>

        {/* 4 */}

        <section className={style.E}>
          <h1>الملكية الفكرية</h1>

          <div className={style.E_box}>
            <div dir="rtl">
              <h6>
                يتولى تقديم خدمات الملكية الفكرية في الشركة فريق من المتخصصين
                وذوي الخبرة في هذا المجال من خال سلسلة مترابطة من الخدمات تشمل
                التسجيل والحماية والتسويق والدفاع وانفاذ أي من حقوق الملكية
                الفكرية عبر شبكة من العلاقات التي تجمعنا بعدد من مكاتب المحاماة
                الدولية المتخصصة في أعمال الملكية الفكرية لعدد من العملاء أخذاً
                في الاعتبار الجانب المالي والتجاري، وتشمل خدماتنا:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>حقوق الطبع والنشر.</li>
                <li>التصاميم الهندسية.</li>
                <li>براءات الاختراع.</li>
                <li>التراخيص والتسويق.</li>
                <li>الأسرار التجارية.</li>
                <li>مراجعة وجرد حقوق الملكية الفكرية.</li>
                <li>
                  اسم الدومين ومواقع الشبكة العنكبوتية والأمور المتعلقة بحقوق
                  الملكية الفكرية أونلاين.
                </li>
              </ul>
            </div>
            <div>
              <img src={four} alt="seo" />
            </div>
          </div>
        </section>

        {/* 5 */}

        <section className={style.B}>
          <h1>العقارات والمقاولات</h1>

          <div className={style.B_box}>
            <div dir="rtl">
              <h6>
                لدينا في الشركة خبرة في التعامل مع كافة النزاعات العقارية وسبق
                لنا مباشرة العديد من الدعاوى العقارية والصفقات والسمسرة
                العقارية، ونقدم الخدمات التالية:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  إعداد وصياغة عقود البيع أو الشراء أو التأجير للكيانات
                  العقارية.
                </li>
                <li>
                  تقديم الرأي والنصح في المسائل والإشكاليات العقارية وبما يحفظ
                  حقوق ومصالح العميل.
                </li>
                <li>
                  تمثيل العميل في المنازعات المتعلقة بملكية العقارات أو
                  المساهمات العقارية، أو دعاوي التعويض عن نزع الملكية للمنفعة
                  العامة.
                </li>
              </ul>
            </div>
            <div>
              <img src={five} alt="seo" />
            </div>
          </div>
        </section>

        {/* 6 */}

        <section className={style.E}>
          <h1>الزكاة والضريبة والجمارك</h1>

          <div className={style.E_box}>
            <div dir="rtl">
              <h6>
                نحظى في شركتنا بتحالف مع أفضل مكاتب المحاسبة القانونية المتخصصة
                في التعامل مع الزكاة والضريبة والجمارك ، بما يسهم في تحقيق
                الحلول المثلى لحماية العميل في النزاعات أو الحالات المتعلقة
                بالزكاة أو الضريبة المفروضة على نشاط العميل، وتقدم المجموعة
                الخدمات التالية:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  تقديم الاستشارات والنصح في المسائل والإشكاليات ذات العالقة
                  بالزكاة أو الضريبة والجمارك.
                </li>
                <li>
                  إعداد الاستئنافات والطعون ضد التقديرات الزكوية والضريبية
                  والجمركية وتقديمها للجان المختصة.
                </li>
                <li>
                  تمثيل العميل في الدعاوى المنظورة أمام اللجان الزكوية والضريبة
                  والجمركية.
                </li>
              </ul>
            </div>
            <div>
              <img src={six} alt="seo" />
            </div>
          </div>
        </section>

        {/* 7 */}

        <section className={style.B}>
          <h1>الاستثمارات وأسواق المال</h1>

          <div className={style.B_box}>
            <div dir="rtl">
              <h6>
                إن سوق التجارة والاستثمار في المملكة العربية السعودية سوق مكتض
                ومزدحم ، و التقدم المستمر في تطبيق أهداف رؤية 2030 جعلت الأسواق
                المالية السعودية محل اهتمام كبرى الشركات والمؤسسات التجارية من
                شتى بقاع العالم بغرض الاستثمار فيها والاستفادة من مكتسباتها
                وثرواتها التجارية ، لذا كان تقديم الخدمات القانونية للمستثمرين
                محل عنايتنا واهتمامنا ، ومن خدماتنا في هذا المجال:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  طرح حزم من الحلول المبتكرة في شأن التعثرات المالية والإدارية.
                </li>
                <li>
                  يقدم المتخصصون لدينا إرشادات حول الحلول المالية الفعالة
                  والآمنة والملائمة للشركات الكبيرة بما في ذلك خدمات المعاملات
                  الدولية.
                </li>
                <li>
                  تقديم المشورات القانونية في أمور الاستثمار للشركات المحلية
                  والأجنبية وإنهاء الإجراءات اللازمة
                </li>
              </ul>
            </div>
            <div>
              <img src={seven} alt="seo" />
            </div>
          </div>
        </section>

        {/* 8 */}

        <section className={style.E}>
          <h1>الموارد البشرية</h1>

          <div className={style.E_box}>
            <div dir="rtl">
              <h6>
                لدينا خبراء متميزين في الجوانب القانونية في الموارد البشرية
                ونظام العمل ومتطلبات وزارة العمل في كافة المسائل ذات العالقة
                بالموارد البشرية من خال الخدمات التالية:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  إعداد وصياغة عقود العمل بكافة أنواعها ( عقد عمل محدد المدة -
                  عقد عمل غير محدد المدة - عقد عمل لبعض الوقت - عقد العمل المؤقت
                  - عقد العمل الموسمي)
                </li>
                <li>
                  إعداد واعتماد لوائح تنظيم العمل الداخلية الإلزامية واعتمادها
                  من وزارة العمل والتنمية الاجتماعية وإعداد اللوائح الإلزامية أو
                  الاسترشادية
                </li>
                <li>
                  إعداد وصياغة السياسات ومنها سياسة التوظيف - سياسة إنهاء وفسخ
                  عقود العمل - سياسة مكافأة نهاية الخدمة - سياسة الإجازات -
                  سياسة الانتدابات - سياسة مكافحة التحرش - سياسة وميثاق السلوك
                  وأخلاقيات العمال
                </li>
                <li>
                  مباشرة تشكيل اللجنة العمالية الداخلية الإلزامية على المنشأة
                  وصياغة إجراءات الترشيحوالتصويت لتشكيل اللجنة واعتمادها من
                  وزارة العمل ووضع سياسة مهام واعمال اللجنة
                </li>
                <li>
                  تمثيل العميل في الدعاوى والمنازعات العمالية بكافة أنواعها
                  ومعالجة المشاكل العمالية الناتجة عن إعادة هيكلة المنشآت
                  وآثارها على العمالة وحقوقهم وعلاقتهم العمالية.
                </li>
                <li>
                  عقد ورش عمل تطويرية وتثقيفية لمنسوبي الموارد البشرية على نظام
                  العمل ولائحته التنفيذية.
                </li>
              </ul>
            </div>
            <div>
              <img src={eight} alt="seo" />
            </div>
          </div>
        </section>

        {/* 9 */}

        <section className={style.B}>
          <h1>الوصايا والأوقاف</h1>

          <div className={style.B_box}>
            <div dir="rtl">
              <h6>
                بات القطاع الثالث - غير الربحي - في المملكة العربية السعودية
                قطاعا مؤثرا في دفع عجلة التنمية ، وأصبح محل اهتمام الكثير من
                شرائح المجتمع وذلك لانتشار ثقافة الوقف في المجتمع السعودي ، حيث
                أن الوقف هو أحد أشكال المسؤولية الاجتماعية التي تتقدم باتجاه
                الممارسة المؤسسية ، والحاجة الى الدراسات الشرعية و القانونية.
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  تقديم المشورات الشرعية و النظامية في مجال الوصايا والأوقاف.
                </li>
                <li>
                  تأسيس الشركات الوقفية نظاميا و إجرائيا من عقود تأسيس ولوائح.
                </li>
                <li>إنهاء إجراءات الوصية والوقف لدى المحاكم و كاتب العدل.</li>
                <li>
                  إعداد الدراسات النظامية عن الكيانات الوقفية ، و الإشراف على
                  تنفيذ شروط الواقفين فيما يتعلق بريع الاستثمار و مصارفه.
                </li>
              </ul>
            </div>
            <div>
              <img src={nine} alt="seo" />
            </div>
          </div>
        </section>

        {/* 10 */}

        <section className={style.E}>
          <h1>الأوراق التجارية والإفلاس والتأمين</h1>

          <div className={style.E_box}>
            <div dir="rtl">
              <h6>
                نولي اهتماما خاصا بالأوراق التجارية ( الشيكات - الكمبيالات -
                السندات لأمر ) و لتعلقها المباشر بالتعاملات التي يجريها عدد كبير
                من الأفراد والمؤسسات والشركات ، كما تضم شركتنا متخصصين في ممارسة
                التأمين لتلبية جميع جوانب صناعة التأمين في الشرق الاوسط، ونقدم
                في هذا المجال الخدمات التالية:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  التمثيل القانوني في العديد من المطالبات العادية والمحالة.
                </li>
                <li>
                  صياغة بوالص التأمين وتقديم المشورة للضامنين والمؤمن لهم.
                </li>
                <li>التفاوض والتسويات والتمثيل في مسائل التحكيم والتقاضي.</li>
                <li>
                  تقديم المشورة القانونية في الإفلاس، وتشمل الرد على المصفين و
                  المستقبلين و الدائنين و المدينين و جميع حالات الإفلاس،
                  والإدارة والحراسة القضائية، والتصفية و التنسيقات الإدارية
                  وتقديم الخدمات القانونية فيه وإنها الإجراءات.
                </li>
                <li>
                  تقديم المشورة النظامية وإيضاح طريقة التعامل القانونية مع
                  الأوراق التجارية ابتداء من تحريرها و انتهاء بالإجراءات الصحيحة
                  لاستيفاء الحق عن طريقها ، و تقديم الخدمات القانونية فيها.
                </li>
              </ul>
            </div>
            <div>
              <img src={ten} alt="seo" />
            </div>
          </div>
        </section>

        {/* 11 */}

        <section className={style.B}>
          <h1>الخدمات المصرفية وتحصيل الديون</h1>

          <div className={style.B_box}>
            <div dir="rtl">
              <h6>
                إن النمو السريع والتطور الكبير في المصرفية المالية الحديثة جعل
                من تعدد وسائل التمويل و تشعب المعاملات المصرفية و تنوع صيغتها
                واقعا يتطلب تضافر جهود ذوي الخبرة و الدراية ، لذا كانت الخدمات
                المصرفية محل اهتمامنا وعنايتنا ، كما اعتنينا بتقديم كافة الخدمات
                الشاملة لتحصيل ديون العملاء بهدف تعزيز قدرة العميل على التحكم في
                الديون الخاصة به وذلك بما يتوافق مع الاحتياجات المحددة لأعماله
                وفق منهج احترافي للغاية ، ومن خدماتنا في هذا الجانب:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  المنازعات المصرفية : تمثيل العملاء في كافة المنازعات المصرفية
                  وأعمال البنوك والمطالبات القانونية الناشئة عن القروض
                  والاعتمادات المستندية وخطابات الضمان وكافة العقود الائتمانية.
                </li>
                <li>
                  نقوم نيابة عن المصارف بتحصيل كافة أنواع الديون من مستحقات
                  الأسهم والأوراق المالية والقروض وكافة التسهيلات الائتمانية
                  الممنوحة لقطاع الأعمال أو الأفراد.
                </li>
              </ul>
            </div>
            <div>
              <img src={eleven} alt="seo" />
            </div>
          </div>
        </section>

        {/* 12 */}

        <section className={style.E}>
          <h1>الطاقة</h1>

          <div className={style.E_box}>
            <div dir="rtl">
              <h6>
                يعتبر قطاع الطاقة والموارد الطبيعية من أسرع القطاعات نمواً في
                العالم، لكونه يلعب دورًا هامًا في الاستثمار وتنمية المشاريع ، إن
                فريقنا القانوني المبني على الخبرة المتعمقة في فهم التحديات
                القانونية واستيعاب احتياجات العملاء يتيح لنا خدمة عملائنا
                بفعالية والحفاظ على سريان مشروعهم في المسار القانوني السليم.
              </h6>
              <h6>
                نحن في شركة سمو الإنصاف نملك خبرة قانونية في صياغة وتحليل
                اتفاقيات وعقود مشاريع الطاقة والتفاوض مع أطرافها، سواءً كانت
                مصادر الطاقة التقليدية كالغاز والفحم والنفط ، أو مصادر الطاقة
                المتجددة كالطاقة الشمسية والطاقة الحرارية وغيرها ، بالإضافة إلى
                ذلك فإننا نقدم لعملائنا المشورة القانونية في كافة جوانب قطاع
                التعدين والمعادن.
              </h6>
            </div>
            <div>
              <img src={tweleve} alt="seo" />
            </div>
          </div>
        </section>

        {/* 13 */}

        <section className={style.B}>
          <h1>التحكيم والوساطة والصلح</h1>

          <div className={style.B_box}>
            <div dir="rtl">
              <h6>
                لقد بات توجه كثير من الشركات والمؤسسات التجارية والأشخاص في حل
                النزاعات المالية و غيرها هو إيجاد حلول أقل تكلفة و طرقا سريعة
                دون التوجه للمقاضاة ولذلك فإن العالم يشهد زيادة في استخدام طرائق
                غير قضائية لتسوية النزاعات و أصبح للمحامين دور الوساطة في ذلك ،
                و بات التحكيم من أفضل الأساليب لتسوية المنازعات التي تنشأ عن أي
                معاملة تجارية ، وبات المحامي ذا دور كبير في الإصلاح بين
                المتخاصمين ، ولذلك كانت الجوانب الغير قضائية محل اهتمامنا
                وعنايتنا ، ومن خدماتنا في هذا الجانب:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  تقديم خدمات الوساطة والتحكيم و التصالح و غيرها من السبل غير
                  القضائية لتسوية المنازعات.
                </li>
                <li>
                  معاونة العملاء في اختيار آلية التسوية البديلة وصياغة بنود عقود
                  الحلول البديلة للتسوية ، وتمثيل العملاء فيها.
                </li>
                <li>
                  صياغة بنود الوساطة والتحكيم وفقراتها في عقود التوظيف واتفاقيات
                  المشاريع المشتركة و اتفاقيات الترخيص والعقود التجارية الأخرى.
                </li>
              </ul>
            </div>
            <div>
              <img src={thirteen} alt="seo" />
            </div>
          </div>
        </section>

        {/* 14 */}

        <section className={style.E}>
          <h1>خدمات التوثيق</h1>

          <div className={style.E_box}>
            <div dir="rtl">
              <h6>
                ترجع أهمية توثيق المعاملات إلى قوله تعالى: يَا أَيُّهَا
                الَّذِينَ آمَنُوا إِذَا تَدَايَنتُمْ بِدَيْنِ إِلَى أَجَلٍ
                مُسَمًّى فاكتبوه ، فالعبرة هنا هو ضمان حقوق كل من الدائن والمدين
                بغض النظر عن مقدار الدين ، وذلك بما يمنحه التوثيق من صبغة
                قانونية للمعاملات المختلفة بين الأطراف في حال نشوء النزاعات لا
                قدر الله ، ومن هذا المنطلق كان التوثيق محل اهتمامنا ورعايتنا ،
                ومن خدماتنا في هذا الجانب:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  توثيق الإقرارات المالية والعلامات التجارية وبراءات الاختراع.
                </li>
                <li>إنهاء إجراءات التوثيق الرسمية لمختلف أنواع العقود.</li>
                <li>
                  إنهاء إجراءات التوثيق الرسمية لرهن العقارات والإقرار بالبيع
                  لمختلف أنواع العقارات وتوثيق عقود الإيجار للعقارات والمقاولات
                  والإفراغ العقاري.
                </li>
                <li>
                  توثيق إجراءات توزيع الميراث وتوثيق حقوق المؤلف والطبع والتأليف
                  والشعارات للشركات والمؤسسات التجارية.
                </li>
              </ul>
            </div>
            <div>
              <img src={fourteen} alt="seo" />
            </div>
          </div>
        </section>

        {/* 15 */}

        <section className={style.B}>
          <h1>التركات</h1>

          <div className={style.B_box}>
            <div dir="rtl">
              <h6>
                إن تقسيم المواريث والتركات عملية حسابية صعبة ومعقدة ترتكز على
                عوامل كثيرة ومتنوعة ولأن محامونا متميزون في هذا الجانب كان تقسيم
                التركات والمواريث محل اهتمامنا وعنايتنا سواء كانت أموالا أم
                عقارات أم مجوهرات أو غيرها ومن خدماتنا في هذا الجانب:
              </h6>

              <ul
                dir="rtl"
                style={{
                  paddingRight: "32px",
                  color: "#777",
                  marginTop: "16px",
                }}
              >
                <li>
                  إنهاء إجراءات حصر التركات والمواريث وحصر الورثة بشكل رسمي و
                  بصورة نظامية.
                </li>
                <li>
                  تقسيم التركات والمواريث وفق المذهب الفقهي المعمول به في
                  المملكة العربية السعودية.
                </li>
              </ul>
            </div>
            <div>
              <img src={fifteen} alt="seo" />
            </div>
          </div>
        </section>
      </div>
      <Footer />
    </>
  );
}
